orgs/2014-10-6-Self-Intro.org
#+STARTUP: showall indent
#+OPTIONS: toc:nil
#+STARTUP: hidestars
#+BEGIN_HTML
---
excerpt: say hello
layout: post
category : personal
tags : [personal]
---
#+END_HTML
* Who am I ?
Hello Hakers.
I'm Terry Lu from Shanghai China. Now I'm mainly focus on algorithm learning, along with embedded linux software development. I love travel and photography.
* About this blog.
This is a blog for recording some technical tips and interesting stuffs I found in daily work.
I used to have a private wiki set up on my workstation. But those kind of things seems to be out of date after I meet static site generator like jekyll and nikola. They works perfectly with the github pages.
Feel free to contact me by email.