_posts/2014-10-6-Self-Intro.html
---
excerpt: say hello
layout: post
category : personal
tags : [personal]
---

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1">Who am I ?</h2>
<div class="outline-text-2" id="text-1">

<p>Hello Hakers.
I'm Terry Lu from Shanghai China. Now I'm mainly focus on algorithm learning, along with embedded linux software development. I love travel and photography.
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2">About this blog.</h2>
<div class="outline-text-2" id="text-2">

<p>This is a blog for recording some technical tips and interesting stuffs I found in daily work.
I used to have a private wiki set up on my workstation. But those kind of things seems to be out of date after I meet static site generator like jekyll and nikola. They works perfectly with the github pages.
Feel free to contact me by email.
</p></div>
</div>
